<?php
//Q[1][0] 是第 1 題的引言
//Q[1][1] 是答錯第 1 題的引言
$Q[1][0]="嗯, 很好, 您有勇氣接受挑戰...<br>
          但是不知道您是不是有勇無謀?";
$Q[1][1]="不會吧, 這應該不難答。<br>
          再試一遍";
//Q[1]['question'] 是第 1 題的問題
//Q[1]['answer'] 是第 1 題的答案
$Q[1]['question']="1 + 1 = ";
$Q[1]['answer']="2";

$Q[2][0]="想不到您居然會加法運算！看來您還有點小聰明。";
$Q[2][1]="平常要多讀點書嘛...<br>
          再試一遍";
$Q[2]['question']="'床前明月光'的下一句是:";
$Q[2]['answer']="疑是地上霜";

$Q[3][0]="居然連李白的詩也會背, 您真有文學素養。";
$Q[3][1]="行萬里路, 讀萬卷書...<br>
          您需要多走走, 增廣見聞才是...<br>
          再試一遍";
$Q[3]['question']="全世界最大的洲是：";
$Q[3]['answer']="亞洲";

$Q[4][0]="上通天文, 下知地理, 我開始有點佩服您了!";
$Q[4][1]="沒有知識也要常看電視<br>
          難道您都沒看電視嗎?<br>
          再試一遍";
$Q[4]['question']="全世界市佔率最高的伺服器端程式語言是";
$Q[4]['answer']="PHP";

$Q[5][0]="連時事新聞都逃不過您的法眼, 真是不可思議!";
$Q[5][1]="要是連這題答案都不知道<br>
          您活著還有什麼意義？
          再試一遍";
$Q[5]['question']="台灣最長的河流是?";
$Q[5]['answer']="濁水溪";

$Q[6]="您真的全過關了！<br>";
?>
